// @strict-types

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОписаниеПеременных

#КонецОбласти
#Область ПрограммныйИнтерфейс

#КонецОбласти

#Область ОбработчикСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ВидНоменклатуры <> Перечисления.ВидНоменклатуры.ПосещениеАттракциона Тогда
		НомерУдаляемого = ПроверяемыеРеквизиты.Найти("КоличествоПосещений");
			Если НомерУдаляемого <> Неопределено Тогда
				ПроверяемыеРеквизиты.Удалить(НомерУдаляемого);
			КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#Область Иницализация

#КонецОбласти

// TODO:
#КонецЕсли