


#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
#Область ПрограммныйИнтерфейс



#КонецОбласти

#Область ОбработчикиСобытий
Процедура ОбработкаПроведения(Отказ,Режим)
    
	ВидАттракциона = ВидАттракциона(Номенклатура);
	// регистр АктивныеПосещения
	Движения.АктивныеПосещения.Записывать = Истина;
	Движение = Движения.АктивныеПосещения.Добавить();
	Движение.Период = Дата;
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Основание = Ссылка;
	Движение.ВидАттракциона = ВидАттракциона;
	Движение.КоличествоПосещений = 1;

	// регистр Продажи
	Движения.Продажи.Записывать = Истина;
	Движение = Движения.Продажи.Добавить();
	Движение.Период = Дата;
	Движение.ВидАттракцион = ВидАттракциона;
	Движение.Сумма = СуммаДокумента;

	
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммыйИнтерфейс
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ВидАттракциона(Номенклатура)
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	|	Номенклатура.ВидАтракциона
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка",Номенклатура);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ВидАтракциона;
	
КонецФункции



#КонецОбласти
#КонецЕсли
