
#Область ПрограммныйИнтерфейс


// Нормализированый номер телефона.
// 
// Параметры:
//  Телефон - Строка - Телефон
//  ВызыватьИсключение - Булево - Вызывать исключение
// 
// Возвращаемое значение:
//  Строка - Нормализированый номер телефона
Функция НормализированыйНомерТелефона(Телефон,ВызыватьИсключение = Ложь) Экспорт
    Цифры = "0123456789";
    ЦифрыТелефона = "";
    Для индекс = 1 По СтрДлина(Телефон) Цикл
        Символ = Сред(Телефон, индекс, 1);
        Если СтрНайти(Цифры, Символ) = 0 Тогда
            Продолжить;
        КонецЕсли;
         
    ЦифрыТелефона = ЦифрыТелефона + Символ;
    КонецЦикла;
    Если СтрНачинаетсяС(ЦифрыТелефона, "8") Тогда
        ЦифрыТелефона = "7" + Сред(ЦифрыТелефона, 2);
        
    КонецЕсли;
    Ошибки = Новый Массив; // Массив из Строки
    Если Не СтрНачинаетсяС(ЦифрыТелефона, "7") Тогда
        Ошибки.Добавить("Первая цифра номера телефона должна быть 7 или 8");
    КонецЕсли;
    Если Ошибки.Количество()> 0 Тогда
        Если ВызыватьИсключение  Тогда
            ВызватьИсключение  СтрСоединить(Ошибки,";");
        Иначе
            Возврат "";
        КонецЕсли;
    КонецЕсли;
    
    Возврат ЦифрыТелефона;   
    
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти
