
&НаКлиенте
Процедура НоменклатураПриИзменении(Элемент)
    Объект.СуммаДокумента = ЦенаНоменклатуры(Объект.Номенклатура,Объект.Дата)
КонецПроцедуры



&НаСервереБезКонтекста
Функция ЦенаНоменклатуры(Знач Параметры,Знач Период)
    Запрос = Новый Запрос;
    Запрос.Текст = "ВЫБРАТЬ
    |    ЦеныНоменклатурыСрезПоследних.Цена
    |ИЗ
    |    РегистрСведений.ЦеныНоменклатуры.СрезПоследних(&Период, Номенклатура = &Номенклатура) КАК
    |        ЦеныНоменклатурыСрезПоследних";
    Запрос.УстановитьПараметр("Период",Период);
    Запрос.УстановитьПараметр("Номенклатура",Параметры);
    Выборка = Запрос.Выполнить().Выбрать();
    Если Выборка.Следующий() Тогда
        Возврат Выборка.Цена;
    КонецЕсли;
    
    Возврат 0;
КонецФункции